PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto.c
#if (CPUSS_CRYPTO_PR == 1) && defined(CY_CRYPTO_CFG_PRNG_C)
cy_en_crypto_status_t Cy_Crypto_Prng_Init(uint32_t lfsr32InitState,
        uint32_t lfsr31InitState,
        uint32_t lfsr29InitState,
        cy_stc_crypto_context_prng_t *cfContext)
{
    cy_en_crypto_status_t err = CY_CRYPTO_NOT_INITIALIZED;

    if (clientContext != NULL)
    {
        clientContext->instr = CY_CRYPTO_INSTR_PRNG_INIT;
        clientContext->xdata = (void *)cfContext;

        cfContext->lfsr32InitState = lfsr32InitState;
        cfContext->lfsr31InitState = lfsr31InitState;
        cfContext->lfsr29InitState = lfsr29InitState;
#if (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)
        /* Flush the cache */
        SCB_CleanDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
        SCB_CleanDCache_by_Addr((volatile void *)cfContext, (int32_t)sizeof(*cfContext));
        SCB_InvalidateDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
#endif

        err = Cy_Crypto_Client_Send();
    }
    return (err);
}

cy_en_crypto_status_t Cy_Crypto_Prng_Generate(uint32_t max,
        uint32_t *randomNum,
        cy_stc_crypto_context_prng_t *cfContext)
{
    cy_en_crypto_status_t err = CY_CRYPTO_NOT_INITIALIZED;

    if (clientContext != NULL)
    {
        clientContext->instr = CY_CRYPTO_INSTR_PRNG;
        clientContext->xdata = (void *)cfContext;

        cfContext->max = max;
        cfContext->prngNum = randomNum;
#if (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)
        /* Flush the cache */
        SCB_CleanDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
        SCB_CleanDCache_by_Addr((volatile void *)cfContext, (int32_t)sizeof(*cfContext));
        SCB_InvalidateDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
        SCB_InvalidateDCache_by_Addr((volatile void *)randomNum, (int32_t)sizeof(uint32_t));
#endif

        err = Cy_Crypto_Client_Send();
    }
    return (err);
}
#endif /* (CPUSS_CRYPTO_PR == 1) && defined(CY_CRYPTO_CFG_PRNG_C) */

#if (CPUSS_CRYPTO_AES == 1) && defined(CY_CRYPTO_CFG_AES_C)
cy_en_crypto_status_t Cy_Crypto_Aes_Init(uint32_t *key,
        cy_en_crypto_aes_key_length_t keyLength,
        cy_stc_crypto_context_aes_t *cfContext)
{
    cy_en_crypto_status_t err = CY_CRYPTO_NOT_INITIALIZED;

    if (clientContext != NULL)
    {
        clientContext->instr = CY_CRYPTO_INSTR_AES_INIT;
        clientContext->xdata = cfContext;

        cfContext->key = key;
        cfContext->keyLength = keyLength;
#if (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)
        /* Flush the cache */
        SCB_CleanDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
        SCB_CleanDCache_by_Addr((volatile void *)cfContext, (int32_t)sizeof(*cfContext));
        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8', 'Intentional typecast to int32_t.');
        SCB_CleanDCache_by_Addr((volatile void *)key, (int32_t)(CY_CRYPTO_AES_128_KEY_SIZE + ((uint32_t)keyLength << 3)));
        SCB_InvalidateDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
#endif

        err = Cy_Crypto_Client_Send();
    }
    return (err);
}

cy_en_crypto_status_t Cy_Crypto_Aes_Ecb_Run(cy_en_crypto_dir_mode_t dirMode,
        uint32_t *dstBlock,
        uint32_t *srcBlock,
        cy_stc_crypto_context_aes_t *cfContext)
{
    cy_en_crypto_status_t err = CY_CRYPTO_NOT_INITIALIZED;

    if (clientContext != NULL)
    {
        clientContext->instr = CY_CRYPTO_INSTR_AES_ECB;
        clientContext->xdata = cfContext;

        cfContext->dirMode = dirMode;
        cfContext->dst = dstBlock;
        cfContext->src = srcBlock;
#if (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)
        /* Flush the cache */
        SCB_CleanDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
        SCB_CleanDCache_by_Addr((volatile void *)cfContext, (int32_t)sizeof(*cfContext));
        SCB_CleanDCache_by_Addr((volatile void *)srcBlock, (int32_t)CY_CRYPTO_AES_BLOCK_SIZE);
        SCB_InvalidateDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
        SCB_InvalidateDCache_by_Addr((volatile void *)dstBlock, (int32_t)CY_CRYPTO_AES_BLOCK_SIZE);
#endif
        err = Cy_Crypto_Client_Send();
    }
    return (err);
}

#if defined(CY_CRYPTO_CFG_CIPHER_MODE_CBC)
cy_en_crypto_status_t Cy_Crypto_Aes_Cbc_Run(cy_en_crypto_dir_mode_t dirMode,
        uint32_t srcSize,
        uint32_t *ivPtr,
        uint32_t *dst,
        uint32_t *src,
        cy_stc_crypto_context_aes_t *cfContext)
{
    cy_en_crypto_status_t err = CY_CRYPTO_NOT_INITIALIZED;

    if (clientContext != NULL)
    {
        clientContext->instr = CY_CRYPTO_INSTR_AES_CBC;
        clientContext->xdata = cfContext;

        cfContext->dirMode = dirMode;
        cfContext->srcSize = srcSize;
        cfContext->ivPtr = ivPtr;
        cfContext->dst = dst;
        cfContext->src = src;
#if (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)
        /* Flush the cache */
        SCB_CleanDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
        SCB_CleanDCache_by_Addr((volatile void *)cfContext, (int32_t)sizeof(*cfContext));
        SCB_CleanDCache_by_Addr((volatile void *)src, (int32_t)srcSize);
        SCB_CleanDCache_by_Addr((volatile void *)ivPtr, (int32_t)CY_CRYPTO_AES_BLOCK_SIZE);
        SCB_InvalidateDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
        SCB_InvalidateDCache_by_Addr((volatile void *)dst, (int32_t)srcSize);
#endif

        err = Cy_Crypto_Client_Send();
    }
    return (err);
}
#endif /* defined(CY_CRYPTO_CFG_CIPHER_MODE_CBC) */

#if defined(CY_CRYPTO_CFG_CIPHER_MODE_CFB)
cy_en_crypto_status_t Cy_Crypto_Aes_Cfb_Run(cy_en_crypto_dir_mode_t dirMode,
        uint32_t srcSize,
        uint32_t *ivPtr,
        uint32_t *dst,
        uint32_t *src,
        cy_stc_crypto_context_aes_t *cfContext)
{
    cy_en_crypto_status_t err = CY_CRYPTO_NOT_INITIALIZED;

    if (clientContext != NULL)
    {
        clientContext->instr = CY_CRYPTO_INSTR_AES_CFB;
        clientContext->xdata = cfContext;

        cfContext->dirMode = dirMode;
        cfContext->srcSize = srcSize;
        cfContext->ivPtr = ivPtr;
        cfContext->dst = dst;
        cfContext->src = src;
#if (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)
        /* Flush the cache */
        SCB_CleanDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
        SCB_CleanDCache_by_Addr((volatile void *)cfContext, (int32_t)sizeof(*cfContext));
        SCB_CleanDCache_by_Addr((volatile void *)src, (int32_t)srcSize);
        SCB_CleanDCache_by_Addr((volatile void *)ivPtr, (int32_t)CY_CRYPTO_AES_BLOCK_SIZE);
        SCB_InvalidateDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
        SCB_InvalidateDCache_by_Addr((volatile void *)dst, (int32_t)srcSize);
#endif

        err = Cy_Crypto_Client_Send();
    }
    return (err);
}
#endif /* defined(CY_CRYPTO_CFG_CIPHER_MODE_CFB) */

