PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto.c
cy_en_crypto_status_t Cy_Crypto_Str_MemCmp(void const *src0,
        void const *src1,
        uint16_t size,
        uint32_t *resultPtr,
        cy_stc_crypto_context_str_t *cfContext)
{
    cy_en_crypto_status_t err = CY_CRYPTO_NOT_INITIALIZED;

    if (clientContext != NULL)
    {
        clientContext->instr = CY_CRYPTO_INSTR_MEM_CMP;
        clientContext->xdata = cfContext;

        cfContext->src0 = src0;
        cfContext->src1 = src1;
        cfContext->dataSize = size;
        cfContext->dst = (void*)resultPtr;
#if (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)
        /* Flush the cache */
        SCB_CleanDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
        SCB_CleanDCache_by_Addr((volatile void *)cfContext, (int32_t)sizeof(*cfContext));
        SCB_CleanDCache_by_Addr((volatile void *)src0, (int32_t)size);
        SCB_CleanDCache_by_Addr((volatile void *)src1, (int32_t)size);
        SCB_InvalidateDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
        SCB_InvalidateDCache_by_Addr((volatile void *)resultPtr, (int32_t)sizeof(*resultPtr));
#endif
        err = Cy_Crypto_Client_Send();
    }
    return (err);
}

cy_en_crypto_status_t Cy_Crypto_Str_MemXor(void const *src0,
        void const *src1,
        void *dst,
        uint16_t size,
        cy_stc_crypto_context_str_t *cfContext)
{
    cy_en_crypto_status_t err = CY_CRYPTO_NOT_INITIALIZED;

    if (clientContext != NULL)
    {
        clientContext->instr = CY_CRYPTO_INSTR_MEM_XOR;
        clientContext->xdata = cfContext;

        cfContext->src0 = src0;
        cfContext->src1 = src1;
        cfContext->dst = dst;
        cfContext->dataSize = size;
#if (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)
        /* Flush the cache */
        SCB_CleanDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
        SCB_CleanDCache_by_Addr((volatile void *)cfContext, (int32_t)sizeof(*cfContext));
        SCB_CleanDCache_by_Addr((volatile void *)src0, (int32_t)size);
        SCB_CleanDCache_by_Addr((volatile void *)src1, (int32_t)size);
        SCB_InvalidateDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
        SCB_InvalidateDCache_by_Addr((volatile void *)dst, (int32_t)size);
#endif

        err = Cy_Crypto_Client_Send();
    }
    return (err);
}
#endif /* #if (CPUSS_CRYPTO_STR == 1) */

#if (CPUSS_CRYPTO_CRC == 1) && defined(CY_CRYPTO_CFG_CRC_C)
cy_en_crypto_status_t Cy_Crypto_Crc_Init(uint32_t polynomial,
        uint8_t  dataReverse,
        uint8_t  dataXor,
        uint8_t  remReverse,
        uint32_t remXor,
        cy_stc_crypto_context_crc_t *cfContext)
{
    cy_en_crypto_status_t err = CY_CRYPTO_NOT_INITIALIZED;

    if (clientContext != NULL)
    {
        clientContext->instr = CY_CRYPTO_INSTR_CRC_INIT;
        clientContext->xdata = cfContext;

        cfContext->dataReverse = dataReverse;
        cfContext->remReverse = remReverse;
        cfContext->dataXor = dataXor;
        cfContext->polynomial = polynomial;
        cfContext->remXor = remXor;
#if (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)
        /* Flush the cache */
        SCB_CleanDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
        SCB_CleanDCache_by_Addr((volatile void *)cfContext, (int32_t)sizeof(*cfContext));
        SCB_InvalidateDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
#endif

        err = Cy_Crypto_Client_Send();
    }
    return (err);
}

cy_en_crypto_status_t Cy_Crypto_Crc_Run(void *data,
                                        uint16_t dataSize,
                                        uint32_t *crc,
                                        uint32_t lfsrInitState,
                                        cy_stc_crypto_context_crc_t *cfContext)
{
    cy_en_crypto_status_t err = CY_CRYPTO_NOT_INITIALIZED;

    if (clientContext != NULL)
    {
        clientContext->instr = CY_CRYPTO_INSTR_CRC;
        clientContext->xdata = cfContext;

        cfContext->lfsrInitState = lfsrInitState;
        cfContext->data  = data;
        cfContext->dataSize = dataSize;
        cfContext->crc = crc;
#if (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)
        /* Flush the cache */
        SCB_CleanDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
        SCB_CleanDCache_by_Addr((volatile void *)cfContext, (int32_t)sizeof(*cfContext));
        SCB_CleanDCache_by_Addr((volatile void *)data, (int32_t)dataSize);
        SCB_InvalidateDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
        SCB_InvalidateDCache_by_Addr((volatile void *)crc, (int32_t)sizeof(*crc));
#endif

        err = Cy_Crypto_Client_Send();
    }
    return (err);
}
#endif /* (CPUSS_CRYPTO_CRC == 1) && defined(CY_CRYPTO_CFG_CRC_C) */

#if (CPUSS_CRYPTO_TR == 1) && defined(CY_CRYPTO_CFG_TRNG_C)
cy_en_crypto_status_t Cy_Crypto_Trng_Generate(uint32_t  GAROPol,
        uint32_t  FIROPol,
        uint32_t  max,
        uint32_t *randomNum,
        cy_stc_crypto_context_trng_t *cfContext)
{
    cy_en_crypto_status_t err = CY_CRYPTO_NOT_INITIALIZED;

    if (clientContext != NULL)
    {
        clientContext->instr = CY_CRYPTO_INSTR_TRNG;
        clientContext->xdata = cfContext;

        cfContext->GAROPol = GAROPol;
        cfContext->FIROPol = FIROPol;
        cfContext->max = max;
        cfContext->trngNum = randomNum;
#if (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)
        /* Flush the cache */
        SCB_CleanDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
        SCB_CleanDCache_by_Addr((volatile void *)cfContext, (int32_t)sizeof(*cfContext));
        SCB_InvalidateDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
        SCB_InvalidateDCache_by_Addr((volatile void *)randomNum, (int32_t)sizeof(*randomNum));
#endif

        err = Cy_Crypto_Client_Send();
    }
    return (err);
}
#endif /* (CPUSS_CRYPTO_TR == 1) && defined(CY_CRYPTO_CFG_TRNG_C) */

