PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto.c
#if (CPUSS_CRYPTO_DES == 1) && defined(CY_CRYPTO_CFG_DES_C)
cy_en_crypto_status_t Cy_Crypto_Des_Run(cy_en_crypto_dir_mode_t dirMode,
                                        uint32_t *key,
                                        uint32_t *dstBlock,
                                        uint32_t *srcBlock,
                                        cy_stc_crypto_context_des_t *cfContext)
{
    cy_en_crypto_status_t err = CY_CRYPTO_NOT_INITIALIZED;

    if (clientContext != NULL)
    {
        clientContext->instr = CY_CRYPTO_INSTR_DES;
        clientContext->xdata = cfContext;

        cfContext->dirMode = dirMode;
        cfContext->key = key;
        cfContext->dst = dstBlock;
        cfContext->src = srcBlock;
#if (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)
        /* Flush the cache */
        SCB_CleanDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
        SCB_CleanDCache_by_Addr((volatile void *)cfContext, (int32_t)sizeof(*cfContext));
        SCB_CleanDCache_by_Addr((volatile void *)key, (int32_t)CY_CRYPTO_DES_KEY_SIZE);
        SCB_CleanDCache_by_Addr((volatile void *)srcBlock, (int32_t)CY_CRYPTO_DES_BLOCK_SIZE);
        SCB_InvalidateDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
        SCB_InvalidateDCache_by_Addr((volatile void *)dstBlock, (int32_t)CY_CRYPTO_DES_BLOCK_SIZE);
#endif

        err = Cy_Crypto_Client_Send();
    }
    return (err);
}

cy_en_crypto_status_t Cy_Crypto_Tdes_Run(cy_en_crypto_dir_mode_t dirMode,
        uint32_t *key,
        uint32_t *dstBlock,
        uint32_t *srcBlock,
        cy_stc_crypto_context_des_t *cfContext)
{
    cy_en_crypto_status_t err = CY_CRYPTO_NOT_INITIALIZED;

    if (clientContext != NULL)
    {
        clientContext->instr = CY_CRYPTO_INSTR_3DES;
        clientContext->xdata = cfContext;

        cfContext->dirMode = dirMode;
        cfContext->key = key;
        cfContext->dst = dstBlock;
        cfContext->src = srcBlock;
#if (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)
        /* Flush the cache */
        SCB_CleanDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
        SCB_CleanDCache_by_Addr((volatile void *)cfContext, (int32_t)sizeof(*cfContext));
        SCB_CleanDCache_by_Addr((volatile void *)key, (int32_t)CY_CRYPTO_TDES_KEY_SIZE);
        SCB_CleanDCache_by_Addr((volatile void *)srcBlock, (int32_t)CY_CRYPTO_DES_BLOCK_SIZE);
        SCB_InvalidateDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
        SCB_InvalidateDCache_by_Addr((volatile void *)dstBlock, (int32_t)CY_CRYPTO_DES_BLOCK_SIZE);
#endif

        err = Cy_Crypto_Client_Send();
    }
    return (err);
}
#endif /* (CPUSS_CRYPTO_DES == 1) && defined(CY_CRYPTO_CFG_DES_C) */

#if (CPUSS_CRYPTO_VU == 1) && defined(CY_CRYPTO_CFG_RSA_C)
cy_en_crypto_status_t Cy_Crypto_SetMemBufAddress(uint32_t const *newMembufAddress,
        uint32_t newMembufSize,
        cy_stc_crypto_context_str_t *cfContext)
{
    cy_en_crypto_status_t err = CY_CRYPTO_NOT_INITIALIZED;

    if (clientContext != NULL)
    {
        clientContext->instr = CY_CRYPTO_INSTR_MEMBUF_SET;
        clientContext->xdata = cfContext;

        cfContext->src0 = newMembufAddress;
        cfContext->dataSize = newMembufSize;
#if (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)
        /* Flush the cache */
        SCB_CleanDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
        SCB_CleanDCache_by_Addr((volatile void *)cfContext, (int32_t)sizeof(*cfContext));
        SCB_InvalidateDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
#endif

        err = Cy_Crypto_Client_Send();
    }
    return (err);
}

cy_en_crypto_status_t Cy_Crypto_GetMemBufAddress(uint32_t **membufAddress,
        cy_stc_crypto_context_str_t *cfContext)
{
    cy_en_crypto_status_t err = CY_CRYPTO_NOT_INITIALIZED;

    if (clientContext != NULL)
    {
        clientContext->instr = CY_CRYPTO_INSTR_MEMBUF_ADDR;
        clientContext->xdata = cfContext;

        cfContext->dst = (void *)membufAddress;
#if (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)
        /* Flush the cache */
        SCB_CleanDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
        SCB_CleanDCache_by_Addr((volatile void *)cfContext, (int32_t)sizeof(*cfContext));
        SCB_InvalidateDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
#endif

        err = Cy_Crypto_Client_Send();
    }
    return (err);
}

cy_en_crypto_status_t Cy_Crypto_GetMemBufSize(uint32_t *membufSize,
        cy_stc_crypto_context_str_t *cfContext)
{
    cy_en_crypto_status_t err = CY_CRYPTO_NOT_INITIALIZED;

    if (clientContext != NULL)
    {
        clientContext->instr = CY_CRYPTO_INSTR_MEMBUF_SIZE;
        clientContext->xdata = cfContext;

        cfContext->dst = (void *)membufSize;
#if (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)
        /* Flush the cache */
        SCB_CleanDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
        SCB_CleanDCache_by_Addr((volatile void *)cfContext, (int32_t)sizeof(*cfContext));
        SCB_InvalidateDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
#endif

        err = Cy_Crypto_Client_Send();
    }
    return (err);
}

cy_en_crypto_status_t Cy_Crypto_Rsa_Proc(cy_stc_crypto_rsa_pub_key_t const *pubKey,
        uint32_t const *message,
        uint32_t messageSize,
        uint32_t *processedMessage,
        cy_stc_crypto_context_rsa_t *cfContext)
{
    cy_en_crypto_status_t err = CY_CRYPTO_NOT_INITIALIZED;

    if (clientContext != NULL)
    {
        clientContext->instr = CY_CRYPTO_INSTR_RSA_PROC;
        clientContext->xdata = cfContext;

        cfContext->key = pubKey;
        cfContext->message = message;
        cfContext->messageSize = messageSize;
        cfContext->result = processedMessage;
#if (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)
        /* Flush the cache */
        if (NULL != pubKey->barretCoefPtr)
        {
            CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8', 'Intentional typecast to int32_t.');
            SCB_CleanDCache_by_Addr((volatile void *)pubKey->barretCoefPtr, (int32_t)(pubKey->moduloLength + 1u));
        }
        if (NULL != pubKey->inverseModuloPtr)
        {
            SCB_CleanDCache_by_Addr((volatile void *)pubKey->inverseModuloPtr, (int32_t)pubKey->moduloLength);
        }
        if (NULL != pubKey->rBarPtr)
        {
            SCB_CleanDCache_by_Addr((volatile void *)pubKey->rBarPtr, (int32_t)pubKey->moduloLength);
        }
        SCB_CleanDCache_by_Addr((volatile void *)pubKey->moduloPtr, (int32_t)pubKey->moduloLength);
        SCB_CleanDCache_by_Addr((volatile void *)pubKey->pubExpPtr, (int32_t)pubKey->pubExpLength);
        SCB_CleanDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
        SCB_CleanDCache_by_Addr((volatile void *)cfContext, (int32_t)sizeof(*cfContext));
        SCB_InvalidateDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
        SCB_InvalidateDCache_by_Addr((volatile void *)processedMessage, (int32_t)messageSize);
#endif

        err = Cy_Crypto_Client_Send();
    }
    return (err);
}

cy_en_crypto_status_t Cy_Crypto_Rsa_CalcCoefs(cy_stc_crypto_rsa_pub_key_t const *pubKey,
        cy_stc_crypto_context_rsa_t *cfContext)
{
    cy_en_crypto_status_t err = CY_CRYPTO_NOT_INITIALIZED;

    if (clientContext != NULL)
    {
        clientContext->instr = CY_CRYPTO_INSTR_RSA_COEF;
        clientContext->xdata = cfContext;

        cfContext->key = pubKey;
#if (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)
        SCB_CleanDCache_by_Addr((volatile void *)pubKey->moduloPtr, (int32_t)pubKey->moduloLength);
        SCB_CleanDCache_by_Addr((volatile void *)pubKey->pubExpPtr, (int32_t)pubKey->pubExpLength);
        SCB_CleanDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
        SCB_CleanDCache_by_Addr((volatile void *)cfContext, (int32_t)sizeof(*cfContext));
        SCB_InvalidateDCache_by_Addr((volatile void *)clientContext, (int32_t)sizeof(*clientContext));
        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8', 'Intentional typecast to int32_t.');
        SCB_InvalidateDCache_by_Addr((volatile void *)pubKey->barretCoefPtr, (int32_t)(pubKey->moduloLength + 1U));
        SCB_InvalidateDCache_by_Addr((volatile void *)pubKey->inverseModuloPtr, (int32_t)pubKey->moduloLength);
        SCB_InvalidateDCache_by_Addr((volatile void *)pubKey->rBarPtr, (int32_t)pubKey->moduloLength);
#endif

        err = Cy_Crypto_Client_Send();
    }
    return (err);
}

#if (CPUSS_CRYPTO_SHA == 1) && defined(CY_CRYPTO_CFG_SHA_C) && defined(CY_CRYPTO_CFG_RSA_VERIFY_ENABLED)
cy_en_crypto_status_t Cy_Crypto_Rsa_Verify(cy_en_crypto_rsa_ver_result_t *verResult,
        cy_en_crypto_sha_mode_t digestType,
        uint32_t const *digest,
        uint32_t const *decryptedSignature,
        uint32_t decryptedSignatureLength,
        cy_stc_crypto_context_rsa_ver_t *cfContext)
{
    cy_en_crypto_status_t err = CY_CRYPTO_NOT_INITIALIZED;

    if (clientContext != NULL)
    {
        clientContext->instr = CY_CRYPTO_INSTR_RSA_VER;
        clientContext->xdata = cfContext;

